//? Операторы кот. необх. знать
// Оператор - это встроенная js - функция
// () - Оператор кот. вызывает определнную функцию

//? ---------------------------------------------------------------------

//                                                                 /
(' Ложные значения кот. необх. знать - undefined, false, null, и скобки ');
//                                                                 /

//                                                                 /
(' 1 - Арифметические - + _плюс, - _минус, * _умножение, / _деление ');
//                                                                 /

//                                                                 /
(' 2 - Сравнения - === _равно, !== _неравно, <= _меньше/равно, >= _больше/равно ');
//                                                                 /

//                                                                 /
(' 3 - Логические - ! _не, && _и, || _или(либо). Оператор ! _не - всегда возвращает значение типа boolean - true, false ');
//                                                                 /

//                                                                 /
(' 4 - Унарные Операторы - ++ _увелич. знач. переменной на еденицу, + _конвертатор строк в число, new _новый экземпляр объекта typeof _показывает тип той или иной переменной ');
//                                                                 /

//                                                                 /
(' 5 - Бинарные Операторы - = _присваивания, += _увеличиваеть значение ');
//

//                                                                 /
(' 6 - Оператор нахождения остатка от деления: % ');
//                                                                 /
