//? Ложные значения
//                                                                 /
(' Ложные значения - undefined, false, null, пустая строка. Чтобы приводить значение к булевым значениям, можно исп. -двойной оператор && - не-, или же вызывать функцию -boolean- и передавать ей то или иное значения. Если попытаться получить доступ к значению свойство кот. нет в объекте, то получим -undefined- ');
//                                                                 /

//? ---------------------------------------------------------------------

//                                                                 /
(' Такие операторы как: > _больше, === _равно, !== _неравно, < _меньше - возрашают сразу же -boolean - булевое- значение ');
//                                                                 /

//? ---------------------------------------------------------------------

//                                                                 /
(' Не undefined дает true - --!undefined === true-- ');
//                                                                 /

//? ---------------------------------------------------------------------

//                                                                 /
(' Нене undefined дает false - --!!undefined === true-- ');
//                                                                 /
