//? Тернарный Оператор
// Рекомендуеться разбивать Т/О на три строки. Первое условие, во второй выражение один (если условие правдиво), и на третьей строки выражение два (если условие ложно)

//? ---------------------------------------------------------------------

// Пример:
const value = 1;
value ? console.log('Условие истинно') : console.log('Условие ложно');
//                                                                 /

// Пример:
const value1 = 11;
const value2 = 25;
value1 && value2 ? myfn1(value1, value2) : myfn2();
//                                                                 /

// Пример:
let val2 = 11;
console.log(val2 >= 0 ? val2 : -val2);
//                                                                 /

// Пример:
val3 = -5;
const res = val3 >= 0 ? val3 : -val3;
console.log(res);
//                                                                 /
